---
kind: property
id: P:Autodesk.Revit.DB.VertexIndexPairArray.IsEmpty
source: html/c0ee32b5-6e5a-213c-6cc4-740c9b91d351.htm
---
# Autodesk.Revit.DB.VertexIndexPairArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.